Show / Hide Table of Contents
Enum SupportTypeInDirrection
Type opf support in the direction
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum SupportTypeInDirrection
Fields
 Name |  Description
 Flexible
Flexible support (Flexible Stiffness is present)
 FlexiblePressOnly
Nonlinear flexible press only
 Free
Free support (no support defined)
 Rigid
Rigid support
 RigidPressOnly
Nonlinear press only
 Improve this Doc
 View Source